#+TITLE: Análisis funcional
#+AUTHOR: Mario Román
#+EMAIL: mromang08@gmail.com

#+SETUPFILE: config.setup
#+LANGUAGE: es

**** Primera matriz
Reduciendo la matriz, tenemos como valores propios:

\[\begin{aligned}
\lambda_1 &= 1+i+\sqrt{1+3i}\\
\lambda_2 &= 1+i-\sqrt{1+3i}
\end{aligned}\]

Calculamos:

\[M\overline{M^T} = 
\begin{pmatrix} 
2 & 4 \\ 4 & 9 
\end{pmatrix}\]

A la que le podemos encontrar los valores propios:

\[\lambda_1 = \frac{1}{2}(11-\sqrt{113})\]

\[\lambda_2 = \frac{1}{2}(11+\sqrt{113})\]

#+BEGIN_SRC sage
M = Matrix([[0,1+i],[1,2+2*i]])
(M*(M.transpose().conjugate())).eigenvalues()
#+END_SRC

#+RESULTS:
: [-1/2*sqrt(113) + 11/2, 1/2*sqrt(113) + 11/2]
: a^2 - 11*a + 18

